test/one_particle_sediment_Re41_IB/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    root            "";
    case            "";
    instance        "";
    local           "";
    class           dictionary;
    object          couplingProperties;
}

/* ---------------------------- sub-models & settings ---------------------------- */

modelType none;

couplingInterval 5;

allowUseSubCFDTimeStep true;

forceModels
(
    ArchimedesIB
    ShirgaonkarIB
);

voidFractionModel IB;

locateModel engineIB;

dataExchangeModel twoWayMPI;

turbulenceModelType turbulenceProperties;

/* ---------------------------- sub-model properties ------------------------- */

ShirgaonkarIBProps
{
    // verbose true;
    velFieldName "U";
    pressureFieldName "p";
}

ArchimedesIBProps
{
    // verbose true;
    gravityFieldName "g";
    volumeFractionFieldName "volumeFractionNext";
}

ArchimedesIBTestProps
{
    gravityFieldName "g";
}

twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsNumPerCoarseParticle 1000000;
}

engineIBProps
{
    treeSearch true;
    zSplit 8;
    xySplit 16;
}
